In [1]:
import pandas as pd

In [2]:
q = [
    ["Pepe",30,True],
    ["Felipe",30,False],
    ["Amanda",20,True]
]

In [3]:
print(q)

[['Pepe', 30, True], ['Felipe', 30, False], ['Amanda', 20, True]]

In [46]:
a = pd.DataFrame(q, columns=["Nombre","Edad","Superado"])
m = pd.DataFrame(q)
print(type(a))
print(a)
display(a)
display(m)

<class 'pandas.core.frame.DataFrame'>
   Nombre  Edad  Superado
0    Pepe    30      True
1  Felipe    30     False
2  Amanda    20      True

   Nombre  Edad  Superado
0    Pepe    30      True
1  Felipe    30     False
2  Amanda    20      True

        0   1      2
0    Pepe  30   True
1  Felipe  30  False
2  Amanda  20   True

In [5]:
a

   Nombre  Edad  Superado
0    Pepe    30      True
1  Felipe    30     False
2  Amanda    20      True

In [6]:
a["Nombre"]

0      Pepe
1    Felipe
2    Amanda
Name: Nombre, dtype: object

In [7]:
# Acceder a una columna devuelve una Serie
col = a["Edad"]
print(type(col))
print(col)
display(col)

<class 'pandas.core.series.Series'>
0    30
1    30
2    20
Name: Edad, dtype: int64

0    30
1    30
2    20
Name: Edad, dtype: int64

In [8]:
b = a[["Nombre","Superado"]]
print(type(b))
b

<class 'pandas.core.frame.DataFrame'>

   Nombre  Superado
0    Pepe      True
1  Felipe     False
2  Amanda      True

In [9]:
a

   Nombre  Edad  Superado
0    Pepe    30      True
1  Felipe    30     False
2  Amanda    20      True

In [10]:
a["Nombre"]

0      Pepe
1    Felipe
2    Amanda
Name: Nombre, dtype: object

In [11]:
a[["Nombre"]]

   Nombre
0    Pepe
1  Felipe
2  Amanda

In [12]:
a["Nota"] = [5,10,10]

In [13]:
a

   Nombre  Edad  Superado  Nota
0    Pepe    30      True     5
1  Felipe    30     False    10
2  Amanda    20      True    10

In [15]:
a.append({
    "Nombre":"juan",
    "Edad":30,
    "Superado":False,
    "Nota":6
}, ignore_index=True)

   Nombre  Edad  Superado  Nota
0    Pepe    30      True     5
1  Felipe    30     False    10
2  Amanda    20      True    10
3    juan    30     False     6

In [19]:
a.append({
    "Nombre":"juanasdfa",
    "Edad":30,
    "Superado":False,
}, ignore_index=True)

      Nombre  Edad  Superado  Nota
0       Pepe    30      True   5.0
1     Felipe    30     False  10.0
2     Amanda    20      True  10.0
3  juanasdfa    30     False   NaN

In [29]:
b = pd.DataFrame([
    ["Luis",28,True,10]
], columns=["Nombre","Edad","Superado","Nota"])
b

  Nombre  Edad  Superado  Nota
0   Luis    28      True    10

In [30]:
a

   Nombre  Edad  Superado  Nota
0    Pepe    30      True     5
1  Felipe    30     False    10
2  Amanda    20      True    10

In [31]:
pd.concat([a,b])

   Nombre  Edad  Superado  Nota
0    Pepe    30      True     5
1  Felipe    30     False    10
2  Amanda    20      True    10
0    Luis    28      True    10

In [39]:
c = pd.concat([a,b], axis=0)

In [42]:
c.append([
    ["JuanLuis",28,True,10]
])

          0     1     2     3  Edad  Nombre  Nota Superado
0       NaN   NaN   NaN   NaN  30.0    Pepe   5.0     True
1       NaN   NaN   NaN   NaN  30.0  Felipe  10.0    False
2       NaN   NaN   NaN   NaN  20.0  Amanda  10.0     True
0       NaN   NaN   NaN   NaN  28.0    Luis  10.0     True
0  JuanLuis  28.0  True  10.0   NaN     NaN   NaN      NaN

In [48]:
x = c.reset_index()

In [49]:
x

   index  Nombre  Edad  Superado  Nota
0      0    Pepe    30      True     5
1      1  Felipe    30     False    10
2      2  Amanda    20      True    10
3      0    Luis    28      True    10

In [50]:
x.columns

Index(['index', 'Nombre', 'Edad', 'Superado', 'Nota'], dtype='object')

In [56]:
# Renombrar columnas
x.columns = [f"Hola{i}" for i in range(5)]

In [57]:
x

   Hola0   Hola1  Hola2  Hola3  Hola4
0      0    Pepe     30   True      5
1      1  Felipe     30  False     10
2      2  Amanda     20   True     10
3      0    Luis     28   True     10

In [60]:
newnames = [e for e in x.columns]
newnames[2] = "pepe"
x.columns = newnames

In [65]:
x

   Hola0   Hola1  pepe  Hola3  Hola4
0      0    Pepe    30   True      5
1      1  Felipe    30  False     10
2      2  Amanda    20   True     10
3      0    Luis    28   True     10

In [66]:
x.T

          0       1       2     3
Hola0     0       1       2     0
Hola1  Pepe  Felipe  Amanda  Luis
pepe     30      30      20    28
Hola3  True   False    True  True
Hola4     5      10      10    10

In [63]:
x.T.reset_index()

   index     0       1       2     3
0  Hola0     0       1       2     0
1  Hola1  Pepe  Felipe  Amanda  Luis
2   pepe    30      30      20    28
3  Hola3  True   False    True  True
4  Hola4     5      10      10    10

In [70]:
x.T

          0       1       2     3
Hola0     0       1       2     0
Hola1  Pepe  Felipe  Amanda  Luis
pepe     30      30      20    28
Hola3  True   False    True  True
Hola4     5      10      10    10

In [69]:
x.T.loc["pepe"]

0    30
1    30
2    20
3    28
Name: pepe, dtype: object

In [73]:
import numpy as np
df = pd.DataFrame(np.random.random((12,4)))

In [76]:
df

           0         1         2         3
0   0.848755  0.743405  0.869803  0.086474
1   0.741278  0.756109  0.479609  0.195630
2   0.848082  0.030617  0.808309  0.977668
3   0.174347  0.317929  0.240850  0.933300
4   0.125573  0.377708  0.429674  0.223225
5   0.797693  0.086061  0.737401  0.087958
6   0.788730  0.122416  0.621820  0.727326
7   0.176912  0.818887  0.035653  0.716705
8   0.919512  0.674833  0.752556  0.196928
9   0.505318  0.965364  0.369179  0.491088
10  0.566500  0.293212  0.219183  0.411987
11  0.704391  0.247008  0.878267  0.048628

In [78]:
df[2]

0     0.869803
1     0.479609
2     0.808309
3     0.240850
4     0.429674
5     0.737401
6     0.621820
7     0.035653
8     0.752556
9     0.369179
10    0.219183
11    0.878267
Name: 2, dtype: float64

In [77]:
df[[2]]

           2
0   0.869803
1   0.479609
2   0.808309
3   0.240850
4   0.429674
5   0.737401
6   0.621820
7   0.035653
8   0.752556
9   0.369179
10  0.219183
11  0.878267

In [79]:
df.loc[2]

0    0.848082
1    0.030617
2    0.808309
3    0.977668
Name: 2, dtype: float64

In [81]:
# NOTA: Columnas con nombres repetidos
cols = ["datos1","datos1","datos2","datos2"]
df = pd.DataFrame(np.random.random((12,4)), columns=cols)
df

      datos1    datos1    datos2    datos2
0   0.953959  0.214826  0.424943  0.805598
1   0.046433  0.186362  0.239669  0.557529
2   0.112049  0.111051  0.905018  0.970590
3   0.369072  0.914618  0.931217  0.817614
4   0.694340  0.114742  0.675677  0.151325
5   0.916941  0.131099  0.241892  0.966121
6   0.261623  0.202313  0.944655  0.670322
7   0.129267  0.602216  0.762462  0.251526
8   0.292389  0.169887  0.158083  0.579229
9   0.597191  0.949945  0.595050  0.627853
10  0.507124  0.848815  0.586868  0.146058
11  0.352004  0.000001  0.162401  0.422795

In [82]:
# Devuelve todas las columnas con nombre "datos1" por eso 
# es un dataframe y no una serie
df["datos1"]

      datos1    datos1
0   0.953959  0.214826
1   0.046433  0.186362
2   0.112049  0.111051
3   0.369072  0.914618
4   0.694340  0.114742
5   0.916941  0.131099
6   0.261623  0.202313
7   0.129267  0.602216
8   0.292389  0.169887
9   0.597191  0.949945
10  0.507124  0.848815
11  0.352004  0.000001

In [84]:
z = df.T

In [85]:
z

,0,1,2,3,4,5,6,7,8,9,10,11
datos1,0.953959,0.046433,0.112049,0.369072,0.694340,0.916941,0.261623,0.129267,0.292389,0.597191,0.507124,0.352004
datos1,0.214826,0.186362,0.111051,0.914618,0.114742,0.131099,0.202313,0.602216,0.169887,0.949945,0.848815,0.000001
datos2,0.424943,0.239669,0.905018,0.931217,0.675677,0.241892,0.944655,0.762462,0.158083,0.595050,0.586868,0.162401
datos2,0.805598,0.557529,0.970590,0.817614,0.151325,0.966121,0.670322,0.251526,0.579229,0.627853,0.146058,0.422795

In [86]:
# loc y iloc son solo para filas
z.loc["datos1"]

,0,1,2,3,4,5,6,7,8,9,10,11
datos1,0.953959,0.046433,0.112049,0.369072,0.694340,0.916941,0.261623,0.129267,0.292389,0.597191,0.507124,0.352004
datos1,0.214826,0.186362,0.111051,0.914618,0.114742,0.131099,0.202313,0.602216,0.169887,0.949945,0.848815,0.000001

In [90]:
# loc y iloc son solo para filas
z.iloc[0]

0     0.953959
1     0.046433
2     0.112049
3     0.369072
4     0.694340
5     0.916941
6     0.261623
7     0.129267
8     0.292389
9     0.597191
10    0.507124
11    0.352004
Name: datos1, dtype: float64

In [89]:
z[0]

datos1    0.953959
datos1    0.214826
datos2    0.424943
datos2    0.805598
Name: 0, dtype: float64

# Part 2

In [103]:
df = pd.DataFrame([
    {
        "name": "Eurobuilding",
        "stars": 4
    },
    {
        "name": "Melia Matadero",
        "stars": 4
    },
    {
        "name": "Palace",
        "stars": 4
    },
    {
        "name": "Ritz",
        "stars": 5
    },
    {
        "name": "Pension Loli",
        "stars": 2
    }
])

In [104]:
df

             name  stars
0    Eurobuilding      4
1  Melia Matadero      4
2          Palace      4
3            Ritz      5
4    Pension Loli      2

In [105]:
df.stars ## --> df["stars"]

0    4
1    4
2    4
3    5
4    2
Name: stars, dtype: int64

In [106]:
["🔥"*s for s in df.stars]

['🔥🔥🔥🔥', '🔥🔥🔥🔥', '🔥🔥🔥🔥', '🔥🔥🔥🔥🔥', '🔥🔥']

In [107]:
df["fuegos"] = ["🔥"*s for s in df.stars]

In [108]:
df

             name  stars fuegos
0    Eurobuilding      4   🔥🔥🔥🔥
1  Melia Matadero      4   🔥🔥🔥🔥
2          Palace      4   🔥🔥🔥🔥
3            Ritz      5  🔥🔥🔥🔥🔥
4    Pension Loli      2     🔥🔥

In [110]:
df.sum(axis=0)

name      EurobuildingMelia MataderoPalaceRitzPension Loli
stars                                                   19
fuegos                                 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥
dtype: object

In [111]:
df.sum(axis=1)

0    4
1    4
2    4
3    5
4    2
dtype: int64

# Loading files with pandas

In [118]:
import os
print(os.getcwd())
poke = pd.read_csv("data/pokemon.csv")

/Users/boyander/IRONHACK/@DATA_EPHEMERAL/datamad0820

In [115]:
poke

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,600,50,100,150,100,150,50,6,True
796,719,DiancieMega Diancie,Rock,Fairy,700,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,600,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,680,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,600,80,110,120,130,90,70,6,True

In [117]:
poke["Attack"].mean()

79.00125

In [119]:
poke.head()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

In [120]:
poke.tail()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
795,719,Diancie,Rock,Fairy,600,50,100,150,100,150,50,6,True
796,719,DiancieMega Diancie,Rock,Fairy,700,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,600,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,680,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,600,80,110,120,130,90,70,6,True

In [124]:
display(poke)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,600,50,100,150,100,150,50,6,True
796,719,DiancieMega Diancie,Rock,Fairy,700,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,600,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,680,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,600,80,110,120,130,90,70,6,True

In [130]:
poke[6:9]

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
6,6,Charizard,Fire,Flying,534,78,84,78,109,85,100,1,False
7,6,CharizardMega Charizard X,Fire,Dragon,634,78,130,111,130,85,100,1,False
8,6,CharizardMega Charizard Y,Fire,Flying,634,78,104,78,159,115,100,1,False

In [136]:
df3 = pd.concat([poke[6:9],poke[0:3]])
df3.reset_index()

,index,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,6,6,Charizard,Fire,Flying,534,78,84,78,109,85,100,1,False
1,7,6,CharizardMega Charizard X,Fire,Dragon,634,78,130,111,130,85,100,1,False
2,8,6,CharizardMega Charizard Y,Fire,Flying,634,78,104,78,159,115,100,1,False
3,0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
4,1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
5,2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False

In [135]:
poke.head(10)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
5,5,Charmeleon,Fire,NaN,405,58,64,58,80,65,80,1,False
6,6,Charizard,Fire,Flying,534,78,84,78,109,85,100,1,False
7,6,CharizardMega Charizard X,Fire,Dragon,634,78,130,111,130,85,100,1,False
8,6,CharizardMega Charizard Y,Fire,Flying,634,78,104,78,159,115,100,1,False
9,7,Squirtle,Water,NaN,314,44,48,65,50,64,43,1,False

In [138]:
q = poke[["Name","Attack"]]
display(q)

                      Name  Attack
0                Bulbasaur      49
1                  Ivysaur      62
2                 Venusaur      82
3    VenusaurMega Venusaur     100
4               Charmander      52
..                     ...     ...
795                Diancie     100
796    DiancieMega Diancie     160
797    HoopaHoopa Confined     110
798     HoopaHoopa Unbound     160
799              Volcanion     110

[800 rows x 2 columns]

In [147]:

# Filtra el dataset y se queda con los pk que tienen ataque > 160
#q[q["Attack"] > 160]
q[q.Attack > 160]

                        Name  Attack
163      MewtwoMega Mewtwo X     190
232  HeracrossMega Heracross     185
268  TyranitarMega Tyranitar     164
387      BanetteMega Banette     165
424    GroudonPrimal Groudon     180
426    RayquazaMega Rayquaza     180
429       DeoxysAttack Forme     180
454                Rampardos     165
494    GarchompMega Garchomp     170
527      GalladeMega Gallade     165
711       KyuremBlack Kyurem     170

In [149]:
# Serie de 800 valores enteros
q.Attack.shape

(800,)

In [157]:
# Al poner un operador lógico se convierte en una serie 
# de valores booleanos (por ejemplo: para filtrar un dataset por filas)
f = q.Attack > 150

In [158]:
print(f.shape)
f

(800,)

0      False
1      False
2      False
3      False
4      False
       ...
795    False
796     True
797    False
798     True
799    False
Name: Attack, Length: 800, dtype: bool

In [159]:
q.shape

(800, 2)

In [160]:
q[f]

                        Name  Attack
137        PinsirMega Pinsir     155
141    GyaradosMega Gyarados     155
163      MewtwoMega Mewtwo X     190
232  HeracrossMega Heracross     185
268  TyranitarMega Tyranitar     164
279    BlazikenMega Blaziken     160
313                  Slaking     160
387      BanetteMega Banette     165
424    GroudonPrimal Groudon     180
426    RayquazaMega Rayquaza     180
429       DeoxysAttack Forme     180
454                Rampardos     165
494    GarchompMega Garchomp     170
527      GalladeMega Gallade     165
543                Regigigas     160
711       KyuremBlack Kyurem     170
796      DiancieMega Diancie     160
798       HoopaHoopa Unbound     160

In [161]:
poke[f]

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
137,127,PinsirMega Pinsir,Bug,Flying,600,65,155,120,65,90,105,1,False
141,130,GyaradosMega Gyarados,Water,Dark,640,95,155,109,70,130,81,1,False
163,150,MewtwoMega Mewtwo X,Psychic,Fighting,780,106,190,100,154,100,130,1,True
232,214,HeracrossMega Heracross,Bug,Fighting,600,80,185,115,40,105,75,2,False
268,248,TyranitarMega Tyranitar,Rock,Dark,700,100,164,150,95,120,71,2,False
279,257,BlazikenMega Blaziken,Fire,Fighting,630,80,160,80,130,80,100,3,False
313,289,Slaking,Normal,NaN,670,150,160,100,95,65,100,3,False
387,354,BanetteMega Banette,Ghost,NaN,555,64,165,75,93,83,75,3,False
424,383,GroudonPrimal Groudon,Ground,Fire,770,100,180,160,150,90,90,3,True
426,384,RayquazaMega Rayquaza,Dragon,Flying,780,105,180,100,180,100,115,3,True
429,386,DeoxysAttack Forme,Psychic,NaN,600,50,180,20,180,20,150,3,True
454,409,Rampardos,Rock,NaN,495,97,165,60,65,50,58,4,False
494,445,GarchompMega Garchomp,Dragon,Ground,700,108,170,115,120,95,92,4,False
527,475,GalladeMega Gallade,Psychic,Fighting,618,68,165,95,65,115,110,4,False
543,486,Regigigas,Normal,NaN,670,110,160,110,80,110,100,4,True
711,646,KyuremBlack Kyurem,Dragon,Ice,700,125,170,100,120,90,95,5,True
796,719,DiancieMega Diancie,Rock,Fairy,700,50,160,110,160,110,110,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,680,80,160,60,170,130,80,6,True

In [162]:
poke[poke.Attack > 160]

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
163,150,MewtwoMega Mewtwo X,Psychic,Fighting,780,106,190,100,154,100,130,1,True
232,214,HeracrossMega Heracross,Bug,Fighting,600,80,185,115,40,105,75,2,False
268,248,TyranitarMega Tyranitar,Rock,Dark,700,100,164,150,95,120,71,2,False
387,354,BanetteMega Banette,Ghost,NaN,555,64,165,75,93,83,75,3,False
424,383,GroudonPrimal Groudon,Ground,Fire,770,100,180,160,150,90,90,3,True
426,384,RayquazaMega Rayquaza,Dragon,Flying,780,105,180,100,180,100,115,3,True
429,386,DeoxysAttack Forme,Psychic,NaN,600,50,180,20,180,20,150,3,True
454,409,Rampardos,Rock,NaN,495,97,165,60,65,50,58,4,False
494,445,GarchompMega Garchomp,Dragon,Ground,700,108,170,115,120,95,92,4,False
527,475,GalladeMega Gallade,Psychic,Fighting,618,68,165,95,65,115,110,4,False
711,646,KyuremBlack Kyurem,Dragon,Ice,700,125,170,100,120,90,95,5,True

In [170]:
poke[(poke.Attack >= 150) & (poke["Type 1"]=="Dragon")]

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
425,384,Rayquaza,Dragon,Flying,680,105,150,90,150,90,95,3,True
426,384,RayquazaMega Rayquaza,Dragon,Flying,780,105,180,100,180,100,115,3,True
494,445,GarchompMega Garchomp,Dragon,Ground,700,108,170,115,120,95,92,4,False
707,644,Zekrom,Dragon,Electric,680,100,150,120,120,100,90,5,True
711,646,KyuremBlack Kyurem,Dragon,Ice,700,125,170,100,120,90,95,5,True

In [171]:
poke[(poke.Attack >= 150) & (poke["Type 1"]=="Dragon") & (poke["Type 2"]=="Flying")]

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
425,384,Rayquaza,Dragon,Flying,680,105,150,90,150,90,95,3,True
426,384,RayquazaMega Rayquaza,Dragon,Flying,780,105,180,100,180,100,115,3,True

In [178]:
m = poke[(poke.Attack >= 150) & (poke["Type 1"]=="Dragon")]
display(m)
m[m["Type 2"]=="Flying"]

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
425,384,Rayquaza,Dragon,Flying,680,105,150,90,150,90,95,3,True
426,384,RayquazaMega Rayquaza,Dragon,Flying,780,105,180,100,180,100,115,3,True
494,445,GarchompMega Garchomp,Dragon,Ground,700,108,170,115,120,95,92,4,False
707,644,Zekrom,Dragon,Electric,680,100,150,120,120,100,90,5,True
711,646,KyuremBlack Kyurem,Dragon,Ice,700,125,170,100,120,90,95,5,True

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
425,384,Rayquaza,Dragon,Flying,680,105,150,90,150,90,95,3,True
426,384,RayquazaMega Rayquaza,Dragon,Flying,780,105,180,100,180,100,115,3,True

In [180]:
m["Type 2"]

425      Flying
426      Flying
494      Ground
707    Electric
711         Ice
Name: Type 2, dtype: object